"""
1. 在syllable\analysis\onset_rhyme\helper.py中，定义：

"SPECIAL_SYLLABLES": {
  "ê1": "ê̄",
  "ê2": "ế",
  "ê3": "ê̌",
  "ê4": "ề",
  "ê5": "ê",
  "m1": "m̄",
  "m2": "ḿ",
  "m3": "m̌",
  "m4": "m̀",
  "m5": "m",
  "n1": "n̄",
  "n2": "ń",
  "n3": "ň",
  "n4": "ǹ",
  "n5": "n",
  "ng1": "n̄g",
  "ng2": "ńg",
  "ng3": "ňg",
  "ng4": "ǹg",
  "ng5": "ng",
  "hm1": "hm̄",
  "hm2": "hḿ",
  "hm3": "hm̌",
  "hm4": "hm̀",
  "hm5": "hm",
  "hn1": "hn̄",
  "hn2": "hń",
  "hn3": "hň",
  "hn4": "hǹ",
  "hn5": "hn",
  "hng1": "hn̄g",
  "hng2": "hńg",
  "hng3": "hňg",
  "hng4": "hǹg",
  "hng5": "hng"
}

2. 在syllable\analysis\onset_rhyme\helper.py中，在输入文件中含有特殊音节"SPECIAL_SYLLABLES"时，
对含有"ê"的音节：
{"ê1": "ê̄",
  "ê2": "ế",
  "ê3": "ê̌",
  "ê4": "ề",
  "ê5": "ê"}
应被分析为以"'"为"onset"和以"ê"为"rhyme"的音节。结果如下：

  "'": {
  "ê1": "ê̄",
  "ê2": "ế",
  "ê3": "ê̌",
  "ê4": "ề",
  "ê5": "ê"
  }

3. 在syllable\analysis\onset_rhyme\helper.py中，在输入文件中含有特殊音节"SPECIAL_SYLLABLES"时，
以"h"开头的音节被分析为以"h"为"onset"和以"m"、"n"和"ng"为"rhyme"的音节，是合适的，无需再作处理。结果如下：
"h": {
    "m1": "m̄",
    "m2": "ḿ",
    "m3": "m̌",
    "m4": "m̀",
    "m5": "m",
    "n1": "n̄",
    "ng1": "n̄g",
    "n2": "ń",
    "ng2": "ńg",
    "n3": "ň",
    "ng3": "ňg",
    "n4": "ǹ",
    "ng4": "ǹg",
    "n5": "n",
    "ng5": "ng",
}
但是，把不以"h"开头的音节分析为以"m"或"n"为"onset"和以空韵""和以"g"为"rhyme"的音节，是不合适的。当前结果如下：
  "m": {
    "1": "̄",
    "2": "́",
    "3": "̌",
    "4": "̀",
    "5": ""
    }
    "n": {
    "1": "̄",
    "2": "́",
    "3": "̌",
    "4": "̀",
    "5": ""
    }
    "ng": {
    "g1": "̄g",
    "g2": "́g",
    "g3": "̌g",
    "g4": "̀g",
    "g5": "g"
    }
这样分析，这些音节没有"rhyme"，不合汉语音节必有rhyme这条语音规则。
因此，为使问题简化，需要将这些被分析为以"m"或"n"为"onset"的音节，修改为以"'"为"onset"、以"m"、"n"或"ng"为"rhyme"的音节。
- 特别是，字母组合"ng"表示"ŋ"，以字母组合"ng"开头的音节不能被分析为以"n"为"onset"、以"g"为"rhyme"音节，应把"ng"作为一个整体分析为"rhyme"。
结果应为：

"'": {
    "m1": "m̄",
    "m2": "ḿ",
    "m3": "m̌",
    "m4": "m̀",
    "m5": "m",
    "n1": "n̄",
    "n2": "ń",
    "n3": "ň",
    "n4": "ǹ",
    "n5": "n",
    "ng1": "n̄g",
    "ng2": "ńg",
    "ng3": "ňg,
    "ng4": "ǹg",
    "ng5": "ng",
}
"""
